Documents/упПодтверждениеЗаявкиНаТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упПодтверждениеЗаявкиНаТС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.упСтатусыЗаявокНаТС</xr:Item>
				<xr:Item>InformationRegister.упПеревозчикПоРейсу</xr:Item>
				<xr:Item>InformationRegister.упЗанятостьТранспорта</xr:Item>
				<xr:Item>InformationRegister.упСтатусыРейсов</xr:Item>
				<xr:Item>AccumulationRegister.упРасходыНаТС</xr:Item>
				<xr:Item>AccumulationRegister.упРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БеречьОтВлаги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БеречьОтИзлучения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БеречьОтНагрева</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапрещеноСкладироватьДругНаДруга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассОпасности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКлассыОпасности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗагрузочныхМетров</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЗагрузочныхМетров</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоМест</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентПеревозчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяВысота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяДлина</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяШирина</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Масса</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Масса</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоРейса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Объем</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеРейса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упЗаявкаНаТС</v8:Type>
						<v8:Type>cfg:DocumentRef.упПредложениеПеревозчика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОценочнаяСтоимость</Name>
					<Comment>Оценочная стоимость груза</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСоглашенияСПеревозчиками</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемпературныйРежим</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТемпературныеРежимы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хрупкий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Экспедитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасовойПояс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упЧасовыеПояса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТипыТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/упЗаявкаНаТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упЗаявкаНаТС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.упСтатусыЗаявокНаТС</xr:Item>
				<xr:Item>InformationRegister.упСтатусыРейсов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БеречьОтВлаги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БеречьОтИзлучения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БеречьОтНагрева</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапрещеноСкладироватьДругНаДруга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассОпасности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКлассыОпасности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗагрузочныхМетров</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЗагрузочныхМетров</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоМест</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентПеревозчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяВысота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяДлина</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяШирина</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Масса</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Масса</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоРейса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Объем</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеРейса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОценочнаяСтоимость</Name>
					<Comment>Оценочная стоимость груза</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоПодбораПеревозчиков</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПравилаПодбораПеревозчиковНаРейсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСоглашенияСПеревозчиками</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРасходы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРасходыНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемпературныйРежим</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТемпературныеРежимы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тендер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТипыТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хрупкий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасовойПояс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упЧасовыеПояса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упЭтапПодбораПеревозчика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПлановыеРасходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упСтатьиДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПравилоРаспределения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упПравилаРаспределенияРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.упЗаданиеНаПеревозкуГруза</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоОпераций</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упСтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/упПодтверждениеЗаявкиНаТС/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс


// Заполнение реквизитов подтверждения заявки на ТС.
//
// Параметры:
//  ПодтверждениеОбъект - ДокументОбъект.упПодтверждениеЗаявкиНаТС. 
//
Процедура ОбработкаЗаполненияПодтвержденияЗаявкиНаТС(ПодтверждениеОбъект) Экспорт
	
	Основание = ПодтверждениеОбъект.Основание;
	Если Не ЗначениеЗаполнено(Основание) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Основание);
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.упЗаявкаНаТС") Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	упЗаявкаНаТС.БеречьОтВлаги КАК БеречьОтВлаги,
		|	упЗаявкаНаТС.БеречьОтИзлучения КАК БеречьОтИзлучения,
		|	упЗаявкаНаТС.БеречьОтНагрева КАК БеречьОтНагрева,
		|	упЗаявкаНаТС.КлассОпасности КАК КлассОпасности,
		|	упЗаявкаНаТС.КоличествоЗагрузочныхМетров КАК КоличествоЗагрузочныхМетров,
		|	упЗаявкаНаТС.КоличествоМест КАК КоличествоМест,
		|	упЗаявкаНаТС.КонтрагентПеревозчика КАК КонтрагентПеревозчика,
		|	упЗаявкаНаТС.МаксимальнаяВысота КАК МаксимальнаяВысота,
		|	упЗаявкаНаТС.МаксимальнаяДлина КАК МаксимальнаяДлина,
		|	упЗаявкаНаТС.МаксимальнаяШирина КАК МаксимальнаяШирина,
		|	упЗаявкаНаТС.Масса КАК Масса,
		|	упЗаявкаНаТС.НачалоРейса КАК НачалоРейса,
		|	упЗаявкаНаТС.Объем КАК Объем,
		|	упЗаявкаНаТС.ОкончаниеРейса КАК ОкончаниеРейса,
		|	упЗаявкаНаТС.ОценочнаяСтоимость КАК ОценочнаяСтоимость,
		|	упЗаявкаНаТС.Перевозчик КАК Перевозчик,
		|	упЗаявкаНаТС.Рейс КАК Рейс,
		|	упЗаявкаНаТС.Соглашение КАК Соглашение,
		|	упЗаявкаНаТС.ТемпературныйРежим КАК ТемпературныйРежим,
		|	упЗаявкаНаТС.ТранспортноеСредство КАК ТранспортноеСредство,
		|	упЗаявкаНаТС.Хрупкий КАК Хрупкий,
		|	упЗаявкаНаТС.ЧасовойПояс КАК ЧасовойПояс,
		|	упЗаявкаНаТС.ЗапрещеноСкладироватьДругНаДруга КАК ЗапрещеноСкладироватьДругНаДруга
		|ИЗ
		|	Документ.упЗаявкаНаТС КАК упЗаявкаНаТС
		|ГДЕ
		|	упЗаявкаНаТС.Ссылка = &Ссылка";
	ИначеЕсли ТипЗнч(ПодтверждениеОбъект.Основание) = Тип("ДокументСсылка.упПредложениеПеревозчика") Тогда	
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	упПредложениеПеревозчика.Водитель1 КАК Водитель1,
		|	упПредложениеПеревозчика.Водитель2 КАК Водитель2,
		|	упПредложениеПеревозчика.ВремяЗавершения КАК ОкончаниеРейса,
		|	упПредложениеПеревозчика.ВремяПодачи КАК НачалоРейса,
		|	упПредложениеПеревозчика.КонтрагентПеревозчика КАК КонтрагентПеревозчика,
		|	упПредложениеПеревозчика.Перевозчик КАК Перевозчик,
		|	упПредложениеПеревозчика.Соглашение КАК Соглашение,
		|	упПредложениеПеревозчика.ТранспортноеСредство КАК ТранспортноеСредство,
		|	упПредложениеПеревозчика.Экспедитор КАК Экспедитор,
		|	упПредложениеПеревозчика.ЧасовойПояс КАК ЧасовойПояс,
		|	упПредложениеПеревозчика.ЗаявкаНаТС.Рейс КАК Рейс
		|ИЗ
		|	Документ.упПредложениеПеревозчика КАК упПредложениеПеревозчика
		|ГДЕ
		|	упПредложениеПеревозчика.Ссылка = &Ссылка";
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(ПодтверждениеОбъект, Выборка);
	КонецЕсли; 
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Интерфейс для работы с подсистемой ЗапретРедактированияРеквизитовОбъектов.

// Возвращает описание блокируемых реквизитов.
//
// Возвращаемое значение:
//     Массив - содержит строки в формате ИмяРеквизита[;ИмяЭлементаФормы,...]
//              где ИмяРеквизита - имя реквизита объекта, ИмяЭлементаФормы - имя элемента формы, связанного с
//              реквизитом.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	БлокируемыеРеквизиты = Новый Массив;
	
	БлокируемыеРеквизиты.Добавить("Рейс");
	
	Возврат БлокируемыеРеквизиты;
	
КонецФункции

#КонецОбласти
